test/tests/simple_multiapp/par/buoyantCavity/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    patch0
    {
        type            wall;
        physicalType    patch;
        nFaces          100;
        startFace       1300;
    }
    patch1
    {
        type            wall;
        physicalType    patch;
        nFaces          50;
        startFace       1400;
    }
    patch2
    {
        type            wall;
        physicalType    patch;
        nFaces          50;
        startFace       1450;
    }
    patch3
    {
        type            wall;
        physicalType    patch;
        nFaces          50;
        startFace       1500;
    }
    patch4
    {
        type            wall;
        physicalType    patch;
        nFaces          50;
        startFace       1550;
    }
    patch5
    {
        type            wall;
        physicalType    patch;
        nFaces          100;
        startFace       1600;
    }
)

// ************************************************************************* //
